)Attr Default(%+_)
/* % type(text  ) intens(high)              Defaults displayed for */
/* + type(text  ) intens(low )                   information only  */
/* _ type( input) intens(high) caps(on ) just(left )               */
   ¬ type(output) intens(high) caps(off) just(asis ) color(turq)
   ` type(text)   intens(low ) caps(off) just(asis ) color(turq)
   ~ type(text) intens(low ) caps(off) just(asis ) color(turq)
         hilite(uscore)
   ! type(text) intens(high) caps(off) just(asis ) color(white)
)BODY
+-------------------% TSO/E-Mail Log Data Set Disposition +---------------------
%Option ===>_zcmd


`    Specify!D`to~delete`or!E`to~edit`your current TSO Mail LOG data set.

`    This is the first time that you have used the TSO/E ISPF Mail Dialog
`    and a pre-existing TSO Mail LOG data set has been detected.  This data
`    set must either be deleted or all old and/or unwanted messages should
`    be deleted before you continue with this dialog.  The reason is that
`    this LOG data set is used to record all messages which are Transmitted
`    or Received and this dialog will use this same data set to copy the
`    messages into an ISPF Table.  The LOG data set is then deleted once this
`    copy has been completed.
`
`    If you elect to continue without cleaning out all of the old and/or
`    unwanted messages the dialog make take a while to copy all of the
`    messages into the ISPF Table.
`
`    The default (PF3) is to continue with the complete LOG data set.
+
)INIT
)PROC
  VER (&ZCMD,NB,LIST,D,E)
)END
